In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [4]:
data= pd.read_excel('fill_na.xlsx')
data.head()

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy

<b>Filling a common value to all missing data

In [5]:
data.fillna(0)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       0.0000   0.000000       0
2 2020-05-08      30.9343   0.000000   rainy
3 2020-05-09       0.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382   0.000000   sunny

<b>Adding Missing data to individual columns

In [9]:
data.fillna({'temperature': 0,
              'windSpeed':10,
              'status':'sunny'
            })

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       0.0000  10.000000   sunny
2 2020-05-08      30.9343  10.000000   rainy
3 2020-05-09       0.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  10.000000   sunny

In [13]:
data.windSpeed.fillna(20)

0    10.788378
1    20.000000
2    20.000000
3     6.889682
4    19.012990
5    20.000000
Name: windSpeed, dtype: float64

In [12]:
data.status.fillna('windy')

0     sunny
1     windy
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

<b>Forward Fill(ROW)

In [15]:
data.fillna(method = 'ffill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

<b>Backward fill(ROW)

In [16]:
data.fillna( method ='bfill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343   6.889682   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

<b>Forward fill (column)

In [19]:
data.fillna(method= 'ffill' , axis = 'columns' )

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

<b>BackwardFill ( columns)

In [20]:
data.fillna( method ='bfill', axis ='columns')

        date temperature  windSpeed  status
0 2020-05-06     35.6582  10.788378   sunny
1 2020-05-07         NaT        NaT     NaT
2 2020-05-08     30.9343      rainy   rainy
3 2020-05-09    6.889682   6.889682  cloudy
4 2020-05-10     13.9082   19.01299   rainy
5 2020-05-11     23.9382      sunny   sunny

<b>Limiting the forward or backward fill

In [44]:
data.fillna( method='ffill' , limit= 1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

In [37]:
data.fillna(method= 'bfill', limit =1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343        NaN   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

In [45]:
data

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

<b>Filling with Pandas objects
There are many Pandas objects like df.sum(), df.max(), etc. we can fill the missing values with
these too.

In [24]:
data.fillna(data.mean())

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

In [25]:
data.fillna(data.median())

        date  temperature  windSpeed  status
0 2020-05-06     35.65820  10.788378   sunny
1 2020-05-07     27.43625  10.788378     NaN
2 2020-05-08     30.93430  10.788378   rainy
3 2020-05-09     27.43625   6.889682  cloudy
4 2020-05-10     13.90820  19.012990   rainy
5 2020-05-11     23.93820  10.788378   sunny

In [49]:
data.fillna(data.mode())

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      23.9382  10.788378   sunny
2 2020-05-08      30.9343  19.012990   rainy
3 2020-05-09      35.6582   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

<b>Filling for specific range of columns

In [30]:
data.fillna( data.mean()['temperature':'windSpeed'])

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

In [31]:
data.fillna(data.mean()['temperature'])

        date  temperature  windSpeed     status
0 2020-05-06    35.658200  10.788378      sunny
1 2020-05-07    26.109725  26.109725  26.109725
2 2020-05-08    30.934300  26.109725      rainy
3 2020-05-09    26.109725   6.889682     cloudy
4 2020-05-10    13.908200  19.012990      rainy
5 2020-05-11    23.938200  26.109725      sunny

<b>Interpolate missing value

<b>Linear interpolate

In [32]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

<b>Different methods to interpolate

In [55]:
data.temperature.interpolate( method = 'barycentric')

0    35.65820
1    39.46530
2    30.93430
3    19.32775
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [46]:
data.temperature.interpolate(method = 'akima')

0    35.658200
1    34.448184
2    30.934300
3    22.421250
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [47]:
data.temperature.interpolate(method = 'pchip')

0    35.658200
1    34.220728
2    30.934300
3    21.496772
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [48]:
data.temperature.interpolate( method ='spline',order =2)

0    35.658200
1    35.076089
2    30.934300
3    20.526966
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [56]:
data.windSpeed.interpolate (method= 'polynomial' , order =2)

0     sunny
1       NaN
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

In [52]:
data.temperature.interpolate ( method = 'polynomial', order =2)

0    35.658200
1    36.196165
2    30.934300
3    19.872606
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [54]:
data.temperature

0    35.6582
1        NaN
2    30.9343
3        NaN
4    13.9082
5    23.9382
Name: temperature, dtype: float64